[
  {
    "id": 1,
    "pergunta": "Em um roteador Linux, o encaminhamento de pacotes para IPv4 foi ativado. Após uma reinicialização, a máquina deixou de encaminhar pacotes IP de outros hosts. O comando: <code>echo 1 > /proc/sys/net/ipv4/ip_forward</code> resolve temporariamente esse problema. Qual das opções a seguir é a melhor maneira de garantir que essa configuração seja salva após as reinicializações do sistema?",
    "opcoes": {
      "A": "Adicionar <code>echo 1 > /proc/sys/net/ipv4/ip_forward</code> ao script de login do usuário root",
      "B": "Adicionar <code>echo 1 > /proc/sys/net/ipv4/ip_forward</code> a qualquer script de login de usuário",
      "C": "Em <code>/etc/sysctl.conf</code>, alterar <code>net.ipv4.ip_forward</code> para 1",
      "D": "Em <code>/etc/rc.local</code>, adicionar <code>net.ipv4.ip_forward = 1</code>",
      "E": "Em <code>/etc/sysconfig/iptables-config</code>, adicionar <code>ipv4.ip_forward = 1</code>"
    },
    "respostaCorreta": "C",
    "explicacao": "O arquivo <code>/etc/sysctl.conf</code> (ou arquivos em <code>/etc/sysctl.d/</code>) é o local padrão para definir permanentemente os parâmetros do kernel. O sistema aplica essas configurações automaticamente durante a inicialização."
  },
  {
    "id": 2,
    "pergunta": "Que informações podem ser encontradas no arquivo especificado pelo parâmetro <code>status</code> em um arquivo de configuração do servidor OpenVPN? (Escolha duas.)",
    "opcoes": {
      "A": "Erros e avisos gerados pelo daemon <code>openvpn</code>",
      "B": "Informações de roteamento",
      "C": "Informações estatísticas sobre o daemon <code>openvpn</code> em execução",
      "D": "Uma lista de clientes conectados atualmente",
      "E": "Um histórico de todos os clientes que se conectaram em algum momento"
    },
    "respostaCorreta": ["B", "D"],
    "explicacao": "O arquivo de status do OpenVPN é um instantâneo do estado atual do servidor. Ele contém uma lista de clientes conectados (Common Name, IP real, IP virtual, bytes enviados/recebidos) e a tabela de roteamento interna do OpenVPN."
  },
  {
    "id": 3,
    "pergunta": "Qual das seguintes linhas no arquivo de configuração do <code>sshd</code> deve ser alterada, caso esteja presente, para aumentar a segurança do servidor? (Escolha duas opções.)",
    "opcoes": {
      "A": "<code>Protocol 2, 1</code>",
      "B": "<code>PermitEmptyPasswords no</code>",
      "C": "<code>Port 22</code>",
      "D": "<code>PermitRootLogin yes</code>",
      "E": "<code>IgnoreRhosts yes</code>"
    },
    "respostaCorreta": ["A", "D"],
    "explicacao": "Para aumentar a segurança: 1) A linha <code>Protocol</code> deve ser alterada para <code>Protocol 2</code> para desabilitar o Protocolo 1, que é antigo e inseguro. 2) <code>PermitRootLogin</code> deve ser alterado para <code>no</code> para impedir o login direto como root."
  },
  {
    "id": 4,
    "pergunta": "Qual dos seguintes parâmetros do <code>nmap</code> verifica um alvo em busca de portas TCP abertas? (Escolha duas.)",
    "opcoes": {
      "A": "<code>-sO</code>",
      "B": "<code>-sZ</code>",
      "C": "<code>-sT</code>",
      "D": "<code>-sU</code>",
      "E": "<code>-sS</code>"
    },
    "respostaCorreta": ["C", "E"],
    "explicacao": "O <code>nmap</code> usa <code>-sT</code> (TCP Connect Scan) e <code>-sS</code> (TCP SYN Scan, ou 'stealth scan') para verificar portas TCP. <code>-sU</code> é usado para portas UDP."
  },
  {
    "id": 5,
    "pergunta": "Quais das afirmações abaixo estão corretas em relação aos seguintes comandos, executados em um roteador Linux? (Escolha duas.)<pre><code>ip6tables -A FORWARD -s fe80 :: /64 -j DROP\nip6tables -A FORWARD -d fe80 :: /64 -j DROP</code></pre>",
    "opcoes": {
      "A": "Pacotes com endereços de origem ou destino da faixa <code>fe80::/64</code> nunca aparecerão na cadeia FORWARD.",
      "B": "As regras desativam o encaminhamento de pacotes porque os nós de rede sempre usam endereços da faixa <code>fe80::/64</code> para identificar roteadores em suas tabelas de roteamento.",
      "C": "O comando <code>ip6tables</code> retorna um erro para o segundo comando porque a rede afetada já faz parte de outra regra.",
      "D": "Ambos os comandos <code>ip6tables</code> são executados sem mensagens de erro ou aviso.",
      "E": "As regras suprimem qualquer configuração automática por meio de anúncios de roteador ou DHCPv6."
    },
    "respostaCorreta": ["A", "D"],
    "explicacao": "Os endereços <code>fe80::/64</code> são endereços 'link-local', usados apenas para comunicação dentro do mesmo segmento de rede. Eles não são roteáveis e, por definição, nunca devem ser 'encaminhados' (FORWARD). As regras são sintaticamente corretas (D) e bloqueiam pacotes que, em teoria, nunca deveriam estar na cadeia FORWARD (A)."
  },
  {
    "id": 6,
    "pergunta": "Qual opção no arquivo de configuração do cliente instruiria o OpenVPN a usar uma porta de origem dinâmica ao estabelecer uma conexão com um par?",
    "opcoes": {
      "A": "<code>src-port</code>",
      "B": "<code>remote</code>",
      "C": "<code>source-port</code>",
      "D": "<code>nobind</code>",
      "E": "<code>dynamic-bind</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "Por padrão, o OpenVPN se vincula (bind) a uma porta de origem local específica. A diretiva <code>nobind</code> impede essa vinculação, fazendo com que o sistema operacional escolha uma porta de origem dinâmica (efêmera) para a conexão."
  },
  {
    "id": 7,
    "pergunta": "Qual usuário Linux é usado pelo <code>vsftpd</code> para realizar operações de sistema para usuários FTP anônimos?",
    "opcoes": {
      "A": "O usuário Linux que executa o processo <code>vsftpd</code>",
      "B": "O usuário Linux que é o proprietário do diretório raiz do FTP servido pelo <code>vsftpd</code>",
      "C": "O usuário Linux com o mesmo nome de usuário que foi usado para fazer login anonimamente no servidor FTP",
      "D": "O usuário Linux <code>root</code>, mas o <code>vsftpd</code> concede acesso a usuários anônimos apenas a arquivos com permissões globais de leitura/escrita",
      "E": "O usuário Linux especificado na opção de configuração <code>ftp_username</code>"
    },
    "respostaCorreta": "E",
    "explicacao": "A diretiva <code>ftp_username</code> no arquivo de configuração do <code>vsftpd</code> especifica qual usuário local do sistema será usado para mapear as permissões de um usuário FTP anônimo. Comumente, este é o usuário 'ftp'."
  },
  {
    "id": 8,
    "pergunta": "Qual das seguintes configurações do <code>sshd</code> deve ser definida como \"no\" para desativar completamente os logins baseados em senha? (Escolha duas.)",
    "opcoes": {
      "A": "<code>PAMAuthentication</code>",
      "B": "<code>ChallengeResponseAuthentication</code>",
      "C": "<code>PermitPlaintextLogin</code>",
      "D": "<code>UsePasswords</code>",
      "E": "<code>PasswordAuthentication</code>"
    },
    "respostaCorreta": ["B", "E"],
    "explicacao": "Para desabilitar totalmente as senhas (forçando o uso de chaves SSH), <code>PasswordAuthentication</code> deve ser <code>no</code>. Além disso, <code>ChallengeResponseAuthentication</code> (usado para senhas interativas, muitas vezes via PAM) também deve ser definido como <code>no</code>."
  },
  {
    "id": 9,
    "pergunta": "Quando a política padrão para a cadeia INPUT do <code>netfilter</code> está definida como DROP, por que deve existir uma regra que permita o tráfego para o <code>localhost</code>?",
    "opcoes": {
      "A": "Todo o tráfego para o <code>localhost</code> deve ser sempre permitido",
      "B": "Isso não importa; o <code>netfilter</code> nunca afeta pacotes endereçados ao <code>localhost</code>",
      "C": "Alguns aplicativos usam a interface <code>localhost</code> para se comunicar com outros aplicativos",
      "D": "O <code>syslogd</code> recebe mensagens no <code>localhost</code>",
      "E": "O comando <code>iptables</code> se comunica com o daemon de gerenciamento do <code>netfilter</code>, o <code>netfilterd</code>, no <code>localhost</code> para criar e alterar regras de filtro de pacotes"
    },
    "respostaCorreta": "C",
    "explicacao": "Muitos serviços em um sistema Linux (como um banco de dados e um servidor web no mesmo host) se comunicam entre si usando a interface de loopback (<code>localhost</code> ou <code>127.0.0.1</code>). Se a política INPUT for DROP, uma regra explícita (<code>-i lo -j ACCEPT</code>) é necessária para permitir essa comunicação interna."
  },
  {
    "id": 10,
    "pergunta": "PREENCHA A LACUNA - Qual comando cria um par de chaves SSH? (Especifique APENAS o comando, sem nenhum caminho ou parâmetro)",
    "tipo": "fill",
    "respostaCorreta": "ssh-keygen",
    "explicacao": "O comando <code>ssh-keygen</code> é a ferramenta padrão usada para criar, gerenciar e converter chaves de autenticação para o protocolo SSH."
  },
  {
    "id": 11,
    "pergunta": "Qual arquivo local deve ser transmitido para um servidor SSH remoto para que seja possível fazer login no servidor remoto usando chaves SSH?",
    "opcoes": {
      "A": "<code>~/.ssh/authorized_keys</code>",
      "B": "<code>~/.ssh/config</code>",
      "C": "<code>~/.ssh/id_rsa.pub</code>",
      "D": "<code>~/.ssh/id_rsa</code>",
      "E": "<code>~/.ssh/known_hosts</code>"
    },
    "respostaCorreta": "C",
    "explicacao": "A chave pública (<code>id_rsa.pub</code>) é o arquivo que você compartilha. Ele deve ser copiado do seu computador local e adicionado ao arquivo <code>~/.ssh/authorized_keys</code> no servidor remoto."
  },
  {
    "id": 12,
    "pergunta": "Qual é o nome do projeto de scanner de segurança de rede que, em sua essência, é um servidor com um conjunto de testes de vulnerabilidade de rede?",
    "opcoes": {
      "A": "<code>NetMap</code>",
      "B": "<code>OpenVAS</code>",
      "C": "<code>Smartscan</code>",
      "D": "<code>Wireshark</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "OpenVAS (Open Vulnerability Assessment System) é um framework de software de código aberto para varredura e gerenciamento de vulnerabilidades. <code>Wireshark</code> é um analisador de pacotes, não um scanner de vulnerabilidades."
  },
  {
    "id": 13,
    "pergunta": "No <code>fail2ban</code>, o que é uma \"prisão\" (jail)?",
    "opcoes": {
      "A": "Uma cadeia de regras do <code>netfilter</code> que bloqueia endereços IP infratores para um serviço específico",
      "B": "Um grupo de serviços no servidor que devem ser monitorados quanto a padrões de ataque semelhantes nos arquivos de log",
      "C": "Uma definição de filtro e um conjunto de uma ou mais ações a serem executadas quando o filtro for correspondido",
      "D": "O ambiente <code>chroot</code> no qual o <code>fail2ban</code> é executado"
    },
    "respostaCorreta": "C",
    "explicacao": "Uma 'jail' no <code>fail2ban</code> (definida em <code>jail.conf</code> ou <code>jail.local</code>) combina um 'filtro' (uma regex para procurar em um log) com uma 'ação' (o que fazer, como banir o IP via <code>iptables</code>)."
  },
  {
    "id": 14,
    "pergunta": "O programa <code>vsftpd</code>, executando em um ambiente <code>chroot</code>, apresenta o seguinte erro:<pre><code>/bin/vsftpd: error while loading shared libraries: libc.so.6: \ncannot open shared object file: No such file or directory.</code></pre>Qual das seguintes ações corrigiria o erro?",
    "opcoes": {
      "A": "O arquivo <code>/etc/ld.so.conf</code> no sistema de arquivos raiz deve conter o caminho para o diretório <code>lib</code> apropriado dentro do ambiente <code>chroot</code>.",
      "B": "Crie um link simbólico que aponte para a biblioteca necessária fora do ambiente <code>chroot</code>.",
      "C": "Copie a biblioteca necessária para o diretório <code>lib</code> apropriado dentro do ambiente <code>chroot</code>.",
      "D": "Execute o programa usando o comando <code>chroot</code> e a opção <code>--static_libs</code>."
    },
    "respostaCorreta": "C",
    "explicacao": "Um ambiente <code>chroot</code> é um 'mini' sistema de arquivos isolado. O binário <code>vsftpd</code> dentro dele não pode ver as bibliotecas do sistema principal. A solução é copiar as bibliotecas compartilhadas necessárias (como <code>libc.so.6</code>) para dentro da estrutura de diretórios do <code>chroot</code> (ex: <code>/caminho/do/chroot/lib64/</code>)."
  },
  {
    "id": 15,
    "pergunta": "Qual dos seguintes parâmetros de configuração do Samba é funcionalmente idêntico ao parâmetro <code>read only=yes</code>?",
    "opcoes": {
      "A": "<code>browseable=no</code>",
      "B": "<code>read write=no</code>",
      "C": "<code>writeable=no</code>",
      "D": "<code>write only=no</code>",
      "E": "<code>write access=no</code>"
    },
    "respostaCorreta": "C",
    "explicacao": "No Samba, <code>read only = yes</code> é o oposto de <code>writeable = yes</code>. Portanto, <code>read only = yes</code> é o mesmo que <code>writeable = no</code>."
  },
  {
    "id": 16,
    "pergunta": "Como o Samba deve ser configurado para que possa verificar as senhas CIFS em relação às encontradas em <code>/etc/passwd</code> e <code>/etc/shadow</code>?",
    "opcoes": {
      "A": "Defina os parâmetros \"encrypt passwords = yes\" e \"password file = /etc/passwd\"",
      "B": "Defina os parâmetros \"encrypt passwords = yes\", \"password file = /etc/passwd\" e \"password algorithm = crypt\"",
      "C": "Exclua o arquivo <code>smbpasswd</code> e crie um link simbólico para os arquivos <code>passwd</code> e <code>shadow</code>",
      "D": "Não é possível para o Samba usar <code>/etc/passwd</code> e <code>/etc/shadow</code> diretamente",
      "E": "Execute <code>smbpasswd</code> para converter <code>/etc/passwd</code> e <code>/etc/shadow</code> em um arquivo de senhas do Samba"
    },
    "respostaCorreta": "D",
    "explicacao": "O Samba não pode usar diretamente os arquivos <code>/etc/passwd</code> e <code>/etc/shadow</code> para autenticação de senha. Ele mantém seu próprio banco de dados de senhas (<code>smbpasswd</code> ou outro backend) porque os protocolos CIFS/SMB requerem hashes de senha em formatos diferentes (NTLM) dos armazenados no <code>/etc/shadow</code> (como SHA-512)."
  },
  {
    "id": 17,
    "pergunta": "Em qual compartilhamento CIFS os drivers de impressora devem ser colocados para permitir a implantação de drivers Point'n'Print no Windows?",
    "opcoes": {
      "A": "<code>winx64drv$</code>",
      "B": "<code>print$</code>",
      "C": "O nome do compartilhamento é especificado na opção <code>print driver share</code> dentro de cada compartilhamento de impressão em <code>smb.conf</code>",
      "D": "<code>pnpdrivers$</code>",
      "E": "<code>NETLOGON</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "O compartilhamento especial <code>[print$]</code> é o local convencional onde os servidores Samba (e Windows) armazenam drivers de impressora para download automático por clientes Windows (recurso Point'n'Print)."
  },
  {
    "id": 18,
    "pergunta": "Qual dos seguintes serviços do Samba gerencia a participação de um servidor de arquivos em um domínio do Active Directory?",
    "opcoes": {
      "A": "<code>winbindd</code>",
      "B": "<code>nmbd</code>",
      "C": "<code>msadd</code>",
      "D": "<code>admemb</code>",
      "E": "<code>samba</code>"
    },
    "respostaCorreta": "A",
    "explicacao": "O daemon <code>winbindd</code> é o serviço do Samba responsável por se comunicar com controladores de domínio (Active Directory ou NT4) para autenticar usuários e grupos do domínio e integrá-los ao sistema Linux local (via NSS e PAM)."
  },
  {
    "id": 19,
    "pergunta": "Qual das seguintes afirmações é verdadeira em relação ao pseudo sistema de arquivos NFSv4 no servidor NFS?",
    "opcoes": {
      "A": "Ele deve ser chamado <code>/exports</code>",
      "B": "Geralmente, ele contém montagens de ligação (bind mounts) das árvores de diretórios a serem exportadas",
      "C": "Ele deve ser uma partição dedicada no servidor",
      "D": "Ele é definido na opção <code>Nfsv4-Root</code> em <code>/etc/pathmapd.conf</code>",
      "E": "Geralmente, ele contém links simbólicos para as árvores de diretórios a serem exportadas"
    },
    "respostaCorreta": "B",
    "explicacao": "O NFSv4 usa um 'pseudo-sistema de arquivos' raiz (definido com <code>fsid=0</code>). Em vez de expor múltiplos compartilhamentos, ele expõe uma única árvore. Os diretórios reais a serem compartilhados (como <code>/home</code> ou <code>/var/www</code>) são disponibilizados dentro dessa árvore usando <code>mount --bind</code>."
  },
  {
    "id": 20,
    "pergunta": "Um usuário solicita um compartilhamento Samba \"oculto\", chamado <code>confidencial</code>, semelhante ao compartilhamento administrativo do Windows. Como isso pode ser configurado?",
    "opcoes": {
      "A": "<pre><code>[confidential]\ncomment = hidden share\npath = /srv/smb/hidden\nwrite list = user\ncreate mask = 0700\ndirectory mask = 0700\n</code></pre>",
      "B": "<pre><code>[$confidential]\ncomment = hidden share\npath = /srv/smb/hidden\nwrite list = user\ncreate mask = 0700\ndirectory mask = 0700\n</code></pre>",
      "C": "<pre><code>[#confidential]\ncomment = hidden share\npath = /srv/smb/hidden\nwrite list = user\ncreate mask = 0700\ndirectory mask = 0700\n</code></pre>",
      "D": "<pre><code>[$confidential]\ncomment = hidden share\npath = /srv/smb/hidden\nwrite list = user\ncreate mask = 0700\ndirectory mask = 0700\n</code></pre>",
      "E": "<pre><code>[confidential$]\ncomment = hidden share\npath = /srv/smb/hidden\nwrite list = user\ncreate mask = 0700\ndirectory mask = 0700\n</code></pre>"
    },
    "respostaCorreta": "E",
    "explicacao": "Para criar um compartilhamento oculto no Samba (equivalente aos compartilhamentos administrativos do Windows como <code>C$</code>), basta adicionar um cifrão (<code>$</code>) ao final do nome do compartilhamento na definição em <code>smb.conf</code>."
  },
  {
    "id": 21,
    "pergunta": "Quais das seguintes opções são válidas em <code>/etc/exports</code>? (Escolha duas.)",
    "opcoes": {
      "A": "<code>rw</code>",
      "B": "<code>ro</code>",
      "C": "<code>rootsquash</code>",
      "D": "<code>norootsquash</code>",
      "E": "<code>uid</code>"
    },
    "respostaCorreta": ["A", "B"],
    "explicacao": "<code>rw</code> (read-write) e <code>ro</code> (read-only) são as opções básicas de permissão no arquivo <code>/etc/exports</code> para definir se os clientes NFS podem escrever no compartilhamento ou apenas ler."
  },
  {
    "id": 22,
    "pergunta": "Qual comando é usado para configurar quais sistemas de arquivos um servidor NFS disponibiliza para os clientes?",
    "opcoes": {
      "A": "<code>exportfs</code>",
      "B": "<code>mkfs.nfs</code>",
      "C": "<code>mount</code>",
      "D": "<code>nfsservct1</code>",
      "E": "<code>telinit</code>"
    },
    "respostaCorreta": "A",
    "explicacao": "O comando <code>exportfs</code> é usado para manter a tabela de sistemas de arquivos exportados pelo servidor NFS. Ele pode ser usado para ler o <code>/etc/exports</code> e aplicar as mudanças (<code>exportfs -a</code>) ou re-exportar todos os diretórios (<code>exportfs -r</code>)."
  },
  {
    "id": 23,
    "pergunta": "Qual dessas ferramentas, sem nenhuma opção adicional, fornece a maior quantidade de informações ao realizar consultas DNS?",
    "opcoes": {
      "A": "<code>dig</code>",
      "B": "<code>nslookup</code>",
      "C": "<code>host</code>",
      "D": "<code>named-checkconf</code>",
      "E": "<code>named-checkzone</code>"
    },
    "respostaCorreta": "A",
    "explicacao": "O <code>dig</code> (Domain Information Groper) é a ferramenta de consulta DNS mais detalhada e padrão. Por padrão, ele exibe a seção da pergunta, a seção da resposta, a seção de autoridade e informações adicionais, incluindo o tempo da consulta."
  },
  {
    "id": 24,
    "pergunta": "A execução de uma consulta DNS com o comando <code>dig</code> resulta nesta resposta:<pre><code>;; QUESTION SECTION:\n;5.123.168.192.in-addr.arpa. IN PTR\n;; ANSWER SECTION:\n5.123.168.192.in-addr.arpa. 600 IN PTR linuserv.example.net.123.168.192.in-addr.arpa.\n;; AUTHORITY SECTION:\n123.168.192.in-addr.arpa. 600 IN NS linuserv.example.net.\n;; ADDITIONAL SECTION:\nlinuserv.example.net. 600 IN A 192.168.123.5</code></pre>Qual é a causa provável desse problema?",
    "opcoes": {
      "A": "Não há um ponto final (<code>.</code>) após <code>linuserv.example.net</code> no registro PTR no arquivo da zona de pesquisa direta.",
      "B": "Não há um ponto final (<code>.</code>) após <code>linuserv</code> no registro PTR no arquivo da zona de pesquisa direta.",
      "C": "Não há um ponto final (<code>.</code>) após <code>linuserv.example.net</code> no registro PTR no arquivo da zona de pesquisa reversa.",
      "D": "O ponto final (<code>.</code>) na definição NS na zona de pesquisa reversa precisa ser removido."
    },
    "respostaCorreta": "C",
    "explicacao": "A resposta PTR está incorreta: <code>linuserv.example.net.123.168.192.in-addr.arpa.</code>. Isso indica que no arquivo de zona de pesquisa reversa, o nome <code>linuserv.example.net</code> foi escrito sem um ponto final (<code>.</code>). Sem o ponto, o BIND anexa o <code>$ORIGIN</code> da zona (<code>123.168.192.in-addr.arpa.</code>) ao nome."
  },
  {
    "id": 25,
    "pergunta": "Qual opção do BIND é necessária nas opções globais para desabilitar as consultas recursivas no servidor DNS por padrão?",
    "opcoes": {
      "A": "<code>allow-recursive-query ( none; );</code>",
      "B": "<code>allow-recursive-query off;</code>",
      "C": "<code>recursion { disabled; };</code>",
      "D": "<code>recursion { none; };</code>",
      "E": "<code>recursion no;</code>"
    },
    "respostaCorreta": "E",
    "explicacao": "A diretiva <code>recursion no;</code> no bloco <code>options</code> do <code>named.conf</code> desabilita a capacidade do servidor BIND de realizar consultas recursivas para clientes. Isso é uma prática de segurança padrão para servidores autoritativos."
  },
  {
    "id": 26,
    "pergunta": "Qual dos seguintes registros DNS poderia ser um registro de cola (glue record)?",
    "opcoes": {
      "A": "<code>ns1.lab A 198.51.100.53</code>",
      "B": "<code>lab NS 198.51.100.53</code>",
      "C": "<code>ns1.lab NS 198.51.100.53</code>",
      "D": "<code>ns1. A 198.51.100.53</code>",
      "E": "<code>ns1.lab GLUE 198.51.100.53</code>"
    },
    "respostaCorreta": "A",
    "explicacao": "Um 'glue record' é um registro <code>A</code> (ou <code>AAAA</code>) que fornece o endereço IP de um servidor de nomes (NS) e é necessário quando o servidor de nomes está *dentro* do domínio que ele serve. A opção A fornece o endereço IP (<code>A</code>) para um servidor de nomes (<code>ns1.lab</code>)."
  },
  {
    "id": 27,
    "pergunta": "Para que serve o DNSSEC?",
    "opcoes": {
      "A": "Para criptografar consultas DNS entre servidores de nomes",
      "B": "Para autenticação criptográfica de zonas DNS",
      "C": "Para consultas DNS secundárias para zonas locais",
      "D": "Para autenticar o usuário que iniciou a consulta DNS",
      "E": "Para criptografar consultas e respostas DNS"
    },
    "respostaCorreta": "B",
    "explicacao": "O DNSSEC (DNS Security Extensions) usa assinaturas digitais para permitir que um cliente DNS verifique criptograficamente que os dados da zona que recebeu são autênticos (vieram da fonte correta) e íntegros (não foram modificados)."
  },
  {
    "id": 28,
    "pergunta": "Qual palavra está faltando no seguinte trecho de um arquivo <code>named.conf</code>?<pre><code>__________ friends {\n  10.10.0.0/24; 192.168.1.0/24;\n};\noptions {\n  allow-query { friends; };\n};</code></pre>",
    "opcoes": {
      "A": "<code>networks</code>",
      "B": "<code>net</code>",
      "C": "<code>list</code>",
      "D": "<code>acl</code>",
      "E": "<code>group</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "No BIND, a diretiva <code>acl</code> (Access Control List) é usada para definir um grupo nomeado de endereços IP (neste caso, 'friends') que pode ser reutilizado em outras diretivas, como <code>allow-query</code>."
  },
  {
    "id": 29,
    "pergunta": "Em um arquivo de zona BIND, o que o caractere <code>@</code> indica?",
    "opcoes": {
      "A": "É o nome de host totalmente qualificado do servidor DNS",
      "B": "É um alias para o endereço de e-mail do administrador da zona",
      "C": "É o nome da zona conforme definido na declaração de zona em <code>named.conf</code>",
      "D": "É usado para criar um alias entre duas entradas CNAME"
    },
    "respostaCorreta": "C",
    "explicacao": "O caractere <code>@</code> é uma variável especial em arquivos de zona BIND que atua como um espaço reservado para o nome da zona (o valor <code>$ORIGIN</code> atual), que é definido na declaração <code>zone</code> em <code>named.conf</code>."
  },
  {
    "id": 30,
    "pergunta": "Qual opção do BIND deve ser usada para limitar os endereços IP dos quais os servidores de nomes secundários podem se conectar?",
    "opcoes": {
      "A": "<code>allow-zone-transfer</code>",
      "B": "<code>allow-transfer</code>",
      "C": "<code>allow-secondary</code>",
      "D": "<code>allow-slaves</code>",
      "E": "<code>allow-queries</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "A diretiva <code>allow-transfer</code> é usada em uma declaração <code>zone</code> para especificar quais endereços IP (normalmente servidores secundários) têm permissão para solicitar uma transferência de zona (AXFR ou IXFR)."
  },
  {
    "id": 31,
    "pergunta": "Para proteger um diretório em um servidor web Apache HTTPD com uma senha, a seguinte configuração foi adicionada a um arquivo <code>.htaccess</code>:<pre><code>AuthType Basic\nAuthName \"Protected Directory\"\nAuthUserFile /var/www/dir/.htpasswd\nRequire valid-user</code></pre>Além disso, um arquivo <code>/var/www/dir/.htpasswd</code> foi criado com o seguinte conteúdo: <code>usera:S3cr3t</code>\n... qual das seguintes afirmações é verdadeira?",
    "opcoes": {
      "A": "O usuário <code>usera</code> pode acessar o site usando a senha <code>s3cr3t</code>",
      "B": "O acesso ao diretório como <code>usera</code> gera o código de erro HTTP 442 (Usuário Inexistente)",
      "C": "As solicitações são respondidas com o código de erro HTTP 500 (Erro Interno do Servidor)",
      "D": "O navegador solicita ao visitante um nome de usuário e senha, mas os logins para <code>usera</code> não funcionam",
      "E": "O servidor web entrega o conteúdo do diretório sem solicitar autenticação"
    },
    "respostaCorreta": "D",
    "explicacao": "A autenticação <code>AuthType Basic</code> não armazena senhas em texto plano. O arquivo <code>AuthUserFile</code> deve conter senhas criptografadas (geradas pelo utilitário <code>htpasswd</code>). Como o arquivo contém uma senha em texto plano (<code>S3cr3t</code>), o Apache não conseguirá verificar a senha e o login falhará."
  },
  {
    "id": 32,
    "pergunta": "Qual diretiva do Apache HTTPD habilita o suporte ao protocolo HTTPS?",
    "opcoes": {
      "A": "<code>HTTPSEngine on</code>",
      "B": "<code>SSLEngine on</code>",
      "C": "<code>SSLEnable on</code>",
      "D": "<code>HTTPSEnable on</code>",
      "E": "<code>StartTLS on</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "A diretiva <code>SSLEngine on</code>, parte do módulo <code>mod_ssl</code>, é a diretiva principal que habilita o processamento SSL/TLS (HTTPS) dentro de um bloco <code><VirtualHost></code>."
  },
  {
    "id": 33,
    "pergunta": "PREENCHA A LACUNA - Qual diretiva de configuração do servidor Apache HTTPD define onde os arquivos de log são armazenados? (Especifique UMA das diretivas sem nenhuma outra opção.)",
    "tipo": "fill",
    "respostaCorreta": ["ErrorLog", "CustomLog", "TransferLog"],
    "explicacao": "<code>ErrorLog</code> define o caminho para o arquivo de log de erros. <code>CustomLog</code> ou <code>TransferLog</code> são diretivas válidas usadas para definir os arquivos de log de acesso."
  },
  {
    "id": 34,
    "pergunta": "Quais afirmações sobre as diretivas <code>Alias</code> e <code>Redirect</code> no arquivo de configuração do Apache HTTPD são verdadeiras? (Escolha duas.)",
    "opcoes": {
      "A": "<code>Alias</code> só pode referenciar arquivos dentro do <code>DocumentRoot</code>",
      "B": "<code>Redirect</code> funciona com expressões regulares",
      "C": "<code>Redirect</code> é processado no lado do cliente",
      "D": "<code>Alias</code> é processado no lado do servidor",
      "E": "<code>Alias</code> não é uma diretiva de configuração válida"
    },
    "respostaCorreta": ["C", "D"],
    "explicacao": "<code>Alias</code> (D) é processado no servidor, mapeando uma URL para um caminho de sistema de arquivos (que pode estar fora do <code>DocumentRoot</code>). <code>Redirect</code> (C) envia uma resposta de redirecionamento (como 301 ou 302) ao navegador, que então faz uma nova solicitação para a nova URL. <code>RedirectMatch</code> é a diretiva que usa expressões regulares."
  },
  {
    "id": 35,
    "pergunta": "Qual diretiva <code>http_access</code> para o Squid permite que os usuários na ACL chamada <code>sales_net</code> acessem a Internet somente nos horários especificados na <code>time_acl</code> chamada <code>sales_time</code>?",
    "opcoes": {
      "A": "<code>http_access deny sales_time sales_net</code>",
      "B": "<code>http_access allow sales_net sales_time</code>",
      "C": "<code>http_access allow sales_net and sales-time</code>",
      "D": "<code>allow http_access sales_net sales_time</code>",
      "E": "<code>http_access sales_net sales_time</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "As regras <code>http_access</code> do Squid processam múltiplas ACLs como uma operação 'E' (AND) lógica. A sintaxe <code>http_access allow sales_net sales_time</code> permite o acesso se a solicitação corresponder à ACL <code>sales_net</code> E à ACL <code>sales_time</code>."
  },
  {
    "id": 36,
    "pergunta": "Qual opção global no arquivo <code>squid.conf</code> define o número ou os números da porta que o Squid usará para ouvir as solicitações dos clientes?",
    "opcoes": {
      "A": "<code>port</code>",
      "B": "<code>client_port</code>",
      "C": "<code>http_port</code>",
      "D": "<code>server_port</code>",
      "E": "<code>squid_port</code>"
    },
    "respostaCorreta": "C",
    "explicacao": "A diretiva <code>http_port</code> (ex: <code>http_port 3128</code>) especifica o endereço IP e a porta nos quais o Squid escutará por solicitações de proxy dos clientes."
  },
  {
    "id": 37,
    "pergunta": "Ao usar o <code>mod_authz_core</code>, quais das seguintes strings podem ser usadas como argumento para <code>Require</code> em um arquivo de configuração do Apache HTTPD para especificar o provedor de autenticação? (Escolha três.)",
    "opcoes": {
      "A": "<code>method</code>",
      "B": "<code>all</code>",
      "C": "<code>regex</code>",
      "D": "<code>header</code>",
      "E": "<code>expr</code>"
    },
    "respostaCorreta": ["A", "B", "E"],
    "explicacao": "<code>Require all granted/denied</code> (B) permite/nega tudo. <code>Require method GET POST</code> (A) restringe por métodos HTTP. <code>Require expr ...</code> (E) permite uma expressão complexa para avaliação. Outros provedores comuns incluem <code>user</code>, <code>group</code> e <code>ip</code>."
  },
  {
    "id": 38,
    "pergunta": "Qual ferramenta cria uma Solicitação de Assinatura de Certificado (CSR) para usar HTTPS com o Apache HTTPD?",
    "opcoes": {
      "A": "<code>apachect1</code>",
      "B": "<code>certgen</code>",
      "C": "<code>cartool</code>",
      "D": "<code>httpsgen</code>",
      "E": "<code>openssl</code>"
    },
    "respostaCorreta": "E",
    "explicacao": "A ferramenta <code>openssl</code> (especificamente <code>openssl req -new</code>) é o utilitário padrão de linha de comando usado para gerar chaves privadas e Solicitações de Assinatura de Certificado (CSRs) para enviar a uma Autoridade Certificadora (CA)."
  },
  {
    "id": 39,
    "pergunta": "Em resposta a uma CSR, uma CA enviou um certificado de servidor web e um certificado de CA intermediária. O que deve ser feito com o certificado intermediário para usar com o Apache HTTPD?",
    "opcoes": {
      "A": "O certificado intermediário deve ser mesclado com o certificado do servidor web em um único arquivo especificado em <code>SSLCertificateFile</code>.",
      "B": "O certificado intermediário deve ser usado para verificar o certificado antes de sua implantação no servidor web e pode ser excluído.",
      "C": "O certificado intermediário deve ser armazenado em seu próprio arquivo, que é referenciado em <code>SSLCaCertificateFile</code>.",
      "D": "O certificado intermediário deve ser adicionado ao armazenamento de certificados do navegador web usado para testar.",
      "E": "O certificado intermediário deve ser arquivado e reenviado à autoridade certificadora para solicitar a renovação."
    },
    "respostaCorreta": "A",
    "explicacao": "Versões modernas do Apache esperam que o certificado do servidor (<code>SSLCertificateFile</code>) contenha o certificado do servidor primeiro, seguido pelos certificados da cadeia intermediária, todos concatenados no mesmo arquivo PEM. A diretiva <code>SSLCACertificateFile</code> (Opção C) é geralmente usada para *autenticação de cliente*, não para a cadeia do servidor."
  },
  {
    "id": 40,
    "pergunta": "PREENCHA A LACUNA - Qual diretiva em um bloco de configuração do servidor Nginx define as portas TCP nas quais o host virtual estará disponível e quais protocolos ele utilizará? (Especifique APENAS o nome da opção, sem nenhum valor.)",
    "tipo": "fill",
    "respostaCorreta": "listen",
    "explicacao": "A diretiva <code>listen</code> (ex: <code>listen 80;</code> ou <code>listen 443 ssl http2;</code>) é usada dentro de um bloco <code>server</code> para definir a porta e o protocolo de escuta."
  },
  {
    "id": 41,
    "pergunta": "Ao tentar configurar um proxy reverso para um servidor web através do Nginx, qual palavra-chave está faltando no seguinte exemplo de configuração?<pre><code>location / {\n  ___________ http://proxiedserver:8080;\n}</code></pre>",
    "opcoes": {
      "A": "<code>remote_proxy</code>",
      "B": "<code>reverse_proxy</code>",
      "C": "<code>proxy_reverse</code>",
      "D": "<code>proxy_pass</code>",
      "E": "<code>forward_to</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "A diretiva <code>proxy_pass</code> é a diretiva fundamental no Nginx para implementar um proxy reverso, especificando o servidor backend para onde o tráfego deve ser encaminhado."
  },
  {
    "id": 42,
    "pergunta": "Se não houver uma diretiva de acesso, qual é a configuração padrão para o OpenLDAP?",
    "opcoes": {
      "A": "<pre><code>access to *\nby * read\n</code></pre>",
      "B": "<pre><code>access to *\nby anonymous none\nby * read\n</code></pre>",
      "C": "<pre><code>access to *\nby anonymous    auth\nby * read\n</code></pre>",
      "D": "<pre><code>access to *\nby anonymous    write\nby * read\n</code></pre>"
    },
    "respostaCorreta": "B",
    "explicacao": "O OpenLDAP opera com o princípio de 'padrão negar' para usuários anônimos, mas 'padrão permitir leitura' para usuários autenticados. A configuração padrão (implícita) nega acesso a usuários anônimos (<code>by anonymous none</code>) e permite acesso de leitura a qualquer usuário autenticado (<code>by * read</code>)."
  },
  {
    "id": 43,
    "pergunta": "Um host, chamado <code>lpi</code>, com o endereço MAC <code>08:00:2b:4c:59:23</code>, deve sempre receber o endereço IP <code>192.168.1.2</code> de um servidor DHCP executando o ISC DHCPD. Qual das seguintes configurações alcançará esse objetivo?",
    "opcoes": {
      "A": "<pre><code>host lpi {\n  hardware-ethernet 08:00:2b:4c:59:23;\n  fixed-address 192.168.1.2;\n}\n</code></pre>",
      "B": "<pre><code>host lpi {\n  mac=08:00:2b:4c:59:23;\n  ip=192.168.1.2;\n}\n</code></pre>",
      "C": "<code>host lpi = 08:00:2b:4c:59:23 192.168.1.2</code>",
      "D": "<pre><code>host lpi {\n  hardware ethernet 08:00:2b:4c:59:23;\n  fixed-address 192.168.1.2;\n}\n</code></pre>",
      "E": "<pre><code>host lpi {\n  hardware-address 08:00:2b:4c:59:23;\n  fixed-ip 192.168.1.2;\n}\n</code></pre>"
    },
    "respostaCorreta": "D",
    "explicacao": "A sintaxe correta do ISC DHCPD para uma reserva de IP estático usa <code>hardware ethernet</code> (com espaço) seguido do endereço MAC, e <code>fixed-address</code> seguido do endereço IP, tudo dentro de um bloco <code>host</code>."
  },
  {
    "id": 44,
    "pergunta": "Como a conta de administrador do LDAP é configurada quando as diretivas <code>rootdn</code> e <code>rootpw</code> não estão presentes no arquivo <code>slapd.conf</code>?",
    "opcoes": {
      "A": "A conta padrão <code>admin</code> com a senha <code>admin</code> é utilizada.",
      "B": "A conta é definida por uma ACL no arquivo <code>slapd.conf</code>.",
      "C": "A conta padrão <code>admin</code> é utilizada sem senha.",
      "D": "A conta é definida no arquivo <code>/etc/ldap.secret</code>.",
      "E": "A conta é definida no arquivo <code>/etc/ldap.root.conf</code>."
    },
    "respostaCorreta": "B",
    "explicacao": "Se <code>rootdn</code> (Root Distinguished Name) não for definido, o acesso administrativo é controlado pelas regras de Acesso (ACLs) definidas no <code>slapd.conf</code> ou no DIT de configuração (olcDatabase)."
  },
  {
    "id": 45,
    "pergunta": "Qual dos seguintes módulos PAM permite ao administrador do sistema usar um arquivo arbitrário contendo uma lista de nomes de usuários e grupos com restrições sobre os recursos do sistema disponíveis para eles?",
    "opcoes": {
      "A": "<code>pam_filter</code>",
      "B": "<code>pam_limits</code>",
      "C": "<code>pam_listfile</code>",
      "D": "<code>pam_unix</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "O módulo <code>pam_limits</code> é responsável por carregar os limites de recursos (<code>ulimits</code>) definidos no arquivo <code>/etc/security/limits.conf</code>, que impõe restrições como número máximo de processos, arquivos abertos, etc., por usuário ou grupo."
  },
  {
    "id": 46,
    "pergunta": "PREENCHA A LACUNA - De acordo com este trecho do arquivo LDIF, a qual unidade organizacional Robert Smith pertence? (Especifique apenas a unidade organizacional.)<pre><code>dn: cn=Robert Smith, ou=people, dc=example, dc=com\n...</code></pre>",
    "tipo": "fill",
    "respostaCorreta": "people",
    "explicacao": "No Nome Distinto (DN) <code>dn: cn=Robert Smith, ou=people, dc=example, dc=com</code>, o atributo <code>ou</code> significa 'Organizational Unit' (Unidade Organizacional). Neste caso, o valor é 'people'."
  },
  {
    "id": 47,
    "pergunta": "Em um arquivo de configuração PAM, qual das seguintes afirmações é verdadeira sobre o sinalizador de controle \"required\"?",
    "opcoes": {
      "A": "Se o módulo retornar sucesso, nenhum outro módulo do mesmo tipo será invocado.",
      "B": "O sucesso do módulo é necessário... Se retornar falha, o controle é retornado para o aplicativo chamador.",
      "C": "O sucesso do módulo é necessário... No entanto, todos os módulos restantes do mesmo tipo serão invocados.",
      "D": "O módulo não é crítico e o fato de retornar sucesso ou falha não é importante.",
      "E": "Se o módulo retornar falha, nenhum outro módulo do mesmo tipo será invocado."
    },
    "respostaCorreta": "C",
    "explicacao": "<code>required</code> significa que o módulo *deve* ter sucesso. No entanto, mesmo que falhe, o PAM continuará executando os outros módulos na pilha (para não vazar informações sobre qual módulo falhou) antes de, no final, relatar a falha ao aplicativo."
  },
  {
    "id": 48,
    "pergunta": "PREENCHA A LACUNA - Qual é o nome do elemento raiz da árvore LDAP que contém a configuração de um servidor OpenLDAP que utiliza configuração baseada em diretório? (Especifique APENAS o nome do elemento, sem nenhuma informação adicional.)",
    "tipo": "fill",
    "respostaCorreta": "slapd",
    "explicacao": "Nas configurações modernas do OpenLDAP (OLC, ou <code>cn=config</code>), a configuração do próprio daemon <code>slapd</code> é armazenada em uma árvore LDAP, cujo DN raiz é <code>cn=config</code>. A configuração específica do backend HDB ou BDB é geralmente <code>olcDatabase={1}hdb,cn=config</code> ou similar."
  },
  {
    "id": 49,
    "pergunta": "Como os módulos PAM são organizados e armazenados?",
    "opcoes": {
      "A": "Como arquivos de texto simples em <code>/etc/security/</code>",
      "B": "Como binários vinculados estaticamente em <code>/etc/pam.d/bin/</code>",
      "C": "Como módulos do kernel Linux dentro do respectivo subdiretório de <code>/lib/modules/</code>",
      "D": "Como arquivos de objeto compartilhado dentro da hierarquia de diretórios <code>/lib/</code>",
      "E": "Como binários vinculados dinamicamente em <code>/usr/lib/pam/sbin/</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "Os módulos PAM (Pluggable Authentication Modules) são arquivos de biblioteca compartilhada (<code>.so</code>), como <code>pam_unix.so</code> ou <code>pam_limits.so</code>, armazenados em diretórios de biblioteca do sistema, como <code>/lib/security/</code> ou <code>/usr/lib/security/</code>."
  },
  {
    "id": 50,
    "pergunta": "Qual das seguintes instruções na configuração do ISC DHCPD é usada para especificar se um pool de endereços pode ou não ser usado por nós que possuem uma seção de <code>host</code> correspondente na configuração?",
    "opcoes": {
      "A": "<code>identified-nodes</code>",
      "B": "<code>unconfigured-hosts</code>",
      "C": "<code>missing-peers</code>",
      "D": "<code>unmatched-hwaddr</code>",
      "E": "<code>unknown-clients</code>"
    },
    "respostaCorreta": "E",
    "explicacao": "A diretiva <code>deny unknown-clients;</code> dentro de um bloco <code>pool</code> ou <code>subnet</code> impede que o servidor DHCPD atribua endereços desse pool a clientes que não tenham uma declaração <code>host</code> (reserva) explícita."
  },
  {
    "id": 51,
    "pergunta": "PREENCHA A LACUNA - Para especificar alterações em uma entrada LDAP, qual palavra-chave está faltando no seguinte trecho do arquivo LDIF?<pre><code>dn: cn=Some Person, dc=example, dc=com\nchangetype: ________\n...</code></pre>Especifique apenas a palavra-chave, sem nenhuma outra informação.",
    "tipo": "fill",
    "respostaCorreta": "add",
    "explicacao": "O atributo <code>changetype</code> em um arquivo LDIF de modificação especifica a operação a ser realizada. Os valores válidos são <code>add</code> (adicionar uma nova entrada), <code>delete</code> (excluir uma entrada), <code>modify</code> (alterar atributos de uma entrada existente) ou <code>moddn</code> (modificar o DN)."
  },
  {
    "id": 52,
    "pergunta": "PREENCHA A LACUNA - Qual comando do cliente OpenLDAP pode ser usado para alterar a senha de uma entrada LDAP? (Especifique SOMENTE o comando, sem nenhum caminho ou parâmetros.)",
    "tipo": "fill",
    "respostaCorreta": "ldappasswd",
    "explicacao": "O comando <code>ldappasswd</code> é o utilitário de linha de comando cliente usado para vincular (bind) a um servidor LDAP e alterar a senha de um usuário."
  },
  {
    "id": 53,
    "pergunta": "Uma empresa está migrando para um novo nome de domínio DNS e deseja receber e-mails para ambos os domínios para todos os seus usuários em um servidor Postfix. Qual opção de configuração deve ser atualizada para conseguir isso?",
    "opcoes": {
      "A": "<code>mydomain</code>",
      "B": "<code>mylocations</code>",
      "C": "<code>mydestination</code>",
      "D": "<code>myhosts</code>",
      "E": "<code>mydomains</code>"
    },
    "respostaCorreta": "C",
    "explicacao": "O parâmetro <code>mydestination</code> no <code>main.cf</code> do Postfix lista todos os domínios que este servidor considera como destino final local. Para receber e-mails para um novo domínio, ele deve ser adicionado a esta lista."
  },
  {
    "id": 54,
    "pergunta": "PREENCHA A LACUNA - Qual é o caminho para o arquivo de configuração global do Postfix? (Especifique o nome completo do arquivo, incluindo o caminho.)",
    "tipo": "fill",
    "respostaCorreta": "/etc/postfix/main.cf",
    "explicacao": "O arquivo <code>/etc/postfix/main.cf</code> é o arquivo de configuração principal que controla a operação global do sistema de e-mail Postfix."
  },
  {
    "id": 55,
    "pergunta": "Quando os filtros Sieve geralmente são aplicados a um e-mail?",
    "opcoes": {
      "A": "Quando o e-mail é entregue a uma caixa de correio",
      "B": "Quando o e-mail é retransmitido por um servidor SMTP",
      "C": "Quando o e-mail é recebido por um servidor SMTP smarthost",
      "D": "Quando o e-mail é enviado para o primeiro servidor por um MUA",
      "E": "Quando o e-mail é recuperado por um MUA"
    },
    "respostaCorreta": "A",
    "explicacao": "Sieve é uma linguagem de filtragem projetada para ser executada no servidor de entrega de correio (MDA - Mail Delivery Agent), como o Dovecot LDA, no momento em que a mensagem está prestes a ser colocada na caixa de correio final do usuário."
  },
  {
    "id": 56,
    "pergunta": "Foi descoberto que o servidor de e-mail da empresa está configurado como um retransmissor aberto. Quais das seguintes ações ajudariam a impedir isso, mantendo a capacidade de receber e-mails da empresa? (Escolha duas.)",
    "opcoes": {
      "A": "Restringir o Postfix para aceitar apenas e-mails para domínios hospedados neste servidor",
      "B": "Configurar o Dovecot para suportar conectividade IMAP",
      "C": "Configurar o <code>netfilter</code> para não permitir tráfego na porta 25 na rede pública",
      "D": "Restringir o Postfix para retransmitir SMTP de saída apenas da rede interna",
      "E": "Atualizar o formato da caixa de correio de mbox para maildir"
    },
    "respostaCorreta": ["A", "D"],
    "explicacao": "Um 'retransmissor aberto' (open relay) aceita e-mails de qualquer pessoa e os envia para qualquer pessoa. Para corrigir isso: 1) Restrinja o recebimento de e-mails apenas para domínios locais (<code>mydestination</code>) (A). 2) Restrinja a permissão de retransmissão (relay) apenas para clientes confiáveis, como a rede interna (<code>mynetworks</code>) (D)."
  },
  {
    "id": 57,
    "pergunta": "Após a instalação do Dovecot, os processos são exibidos no <code>ps ax</code> como:<pre><code>31248 ? S 0:00 dovecot/imap\n31253 ? S 0:00 dovecot/imap-login</code></pre>Para associar os processos aos usuários e clientes (exibindo nome de usuário, IP, status), qual opção deve ser configurada?",
    "opcoes": {
      "A": "<code>--with-linux-extprocnames</code> para <code>./configure</code> durante a compilação",
      "B": "<code>sys.ps.allow_descriptions = 1</code> em <code>sysctl.conf</code>",
      "C": "<code>proc.all.show_status = 1</code> em <code>sysctl.conf</code>",
      "D": "<code>verbose_proctitle = yes</code> na configuração do Dovecot",
      "E": "<code>process_format = \"%u %I %s\"</code> na configuração do Dovecot"
    },
    "respostaCorreta": "D",
    "explicacao": "Definir <code>verbose_proctitle = yes</code> no <code>dovecot.conf</code> faz com que o Dovecot altere o título de seus processos filhos (visível no <code>ps</code>) para incluir informações detalhadas sobre a conexão, como o nome de usuário e o endereço IP do cliente."
  },
  {
    "id": 58,
    "pergunta": "Qual comando do Postfix pode ser usado para reconstruir todos os arquivos do banco de dados de aliases com uma única execução e sem a necessidade de nenhum argumento de linha de comando?",
    "opcoes": {
      "A": "<code>makealiases</code>",
      "B": "<code>newaliases</code>",
      "C": "<code>postalias</code>",
      "D": "<code>postmapbuild</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "O comando <code>newaliases</code> é um wrapper que lê o arquivo <code>/etc/aliases</code> e executa <code>postalias</code> para construir o arquivo de banco de dados (ex: <code>/etc/aliases.db</code>) que o Postfix usa."
  },
  {
    "id": 59,
    "pergunta": "PREENCHA A LACUNA - Qual ação em um filtro Sieve encaminha uma mensagem para outro endereço de e-mail sem alterar a mensagem? (Especifique APENAS o nome da ação sem quaisquer parâmetros.)",
    "tipo": "fill",
    "respostaCorreta": "redirect",
    "explicacao": "No Sieve, a ação <code>redirect</code> encaminha a mensagem para um novo destinatário. Isso difere de <code>forward</code>, que encapsularia a mensagem como um anexo."
  },
  {
    "id": 60,
    "pergunta": "Quais dos seguintes mecanismos de autenticação são suportados pelo Dovecot? (Escolha três.)",
    "opcoes": {
      "A": "<code>ldap</code>",
      "B": "<code>digest-md5</code>",
      "C": "<code>cram-md5</code>",
      "D": "<code>plain</code>",
      "E": "<code>krb5</code>"
    },
    "respostaCorreta": ["B", "C", "D"],
    "explicacao": "Dovecot suporta uma ampla gama de mecanismos SASL, incluindo <code>PLAIN</code>, <code>LOGIN</code> (ambos texto puro, D), <code>CRAM-MD5</code> (C) e <code>DIGEST-MD5</code> (B). <code>ldap</code> (A) e <code>krb5</code> (E) são *backends* de autenticação, não mecanismos SASL em si."
  },
  {
    "id": 61,
    "pergunta": "Qual dos seguintes serviços pertence ao NFSv4 e não existe no NFSv3?",
    "opcoes": {
      "A": "<code>rpc.idmapd</code>",
      "B": "<code>rpc.statd</code>",
      "C": "<code>nfsd</code>",
      "D": "<code>rpc.mountd</code>"
    },
    "respostaCorreta": "A",
    "explicacao": "O NFSv4 usa nomes de usuário/grupo no formato <code>user@domain</code> em vez de UIDs/GIDs numéricos. O daemon <code>rpc.idmapd</code> é responsável por mapear esses nomes de e para os UIDs/GIDs locais, um componente que não era necessário no NFSv3."
  },
  {
    "id": 62,
    "pergunta": "Qual das seguintes ações sincroniza as senhas do UNIX com as senhas do Samba quando a senha criptografada do Samba é alterada usando <code>smbpasswd</code>?",
    "opcoes": {
      "A": "Não há ações para realizar isso, pois não é possível.",
      "B": "Execute o <code>netvamp</code> regularmente para converter las senhas.",
      "C": "Execute <code>winbind \"sync\"</code> para sincronizar as senhas.",
      "D": "Adicione <code>unix password sync = yes</code> ao <code>smb.conf</code>",
      "E": "Adicione <code>smb unix password = sync</code> ao <code>smb.conf</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "A diretiva <code>unix password sync = yes</code> no <code>smb.conf</code> instrui o Samba a tentar atualizar a senha UNIX do usuário (em <code>/etc/shadow</code>) sempre que o usuário altera sua senha do Samba usando ferramentas como <code>smbpasswd</code>."
  },
  {
    "id": 63,
    "pergunta": "Para ingressar um servidor de arquivos ao domínio do Active Directory <code>intra.example.com</code>, o seguinte <code>smb.conf</code> foi criado:<pre><code>[global]\nworkgroup = intra.example.com\nnetbios name = Fileserver\nserver role = member server\nidmap config * : backend = tdb\nidmap config * : range = 10000-199999\nwinbind enum users = yes\nwinbind enum group = yes</code></pre>O comando <code>net ads join</code> gera um erro. O que deve ser feito para ingressar o domínio com sucesso?",
    "opcoes": {
      "A": "Altere a função do servidor para <code>servidor membro do AD</code>.",
      "B": "Adicione <code>realm = intra.example.com</code> ao <code>smb.conf</code> e altere o <code>workgroup</code> para o nome NetBIOS do domínio.",
      "C": "Crie manualmente uma conta de máquina no AD e especifique o nome da conta com <code>-U</code>.",
      "D": "Remova as opções <code>winbind enum users</code> e <code>winbind enum groups</code>.",
      "E": "Remova todas as seções de <code>idmap</code>."
    },
    "respostaCorreta": "B",
    "explicacao": "Para ingressar em um domínio Active Directory, o Samba requer duas diretivas principais: <code>workgroup</code> (que deve ser o nome NetBIOS do domínio, ex: 'INTRA') e <code>realm</code> (que deve ser o FQDN Kerberos do domínio, ex: 'INTRA.EXAMPLE.COM'). A configuração atual usou o FQDN no <code>workgroup</code> e omitiu o <code>realm</code>."
  },
  {
    "id": 64,
    "pergunta": "PREENCHA A LACUNA - Para exportar <code>/usr</code> e <code>/bin</code> via NFSv4, <code>/exports</code> foi criado com bind mounts. As seguintes linhas foram adicionadas ao <code>/etc/exports</code>:<pre><code>/exports 192.0.1.0/24 (rw, sync, fsid=0, crossmnt, no_subtree_check)\n/exports/usr 192.0.2.0/24 (rw, sync, fsid=0, crossmnt, no_subtree_check)\n/exports/bin 192.0.2.0/24 (rw, sync, fsid=0, crossmnt, no_subtree_check)</code></pre>...montar <code>server:/</code> em <code>/mnt</code> resulta no conteúdo de <code>/usr</code>. Qual opção em <code>/etc/exports</code> precisa ser alterada ou removida para corrigir isso? (Especifique APENAS o nome da opção, sem valores ou parâmetros.)",
    "tipo": "fill",
    "respostaCorreta": "fsid",
    "explicacao": "O erro está em repetir <code>fsid=0</code>. A opção <code>fsid=0</code> é especial e designa a raiz do pseudo-sistema de arquivos NFSv4. Ela só deve aparecer na linha <code>/exports</code>. Ela não deve ser usada nas exportações filhas (<code>/exports/usr</code> e <code>/exports/bin</code>). A opção <code>fsid</code> nessas linhas deve ser removida ou alterada para um valor único."
  },
  {
    "id": 65,
    "pergunta": "O que o comando <code>samba-tool testparm</code> confirma em relação à configuração do Samba?",
    "opcoes": {
      "A": "A configuração é carregada com sucesso.",
      "B": "O serviço funciona conforme o esperado.",
      "C": "Os serviços Samba são iniciados automaticamente quando o sistema inicializa.",
      "D": "A configuração do <code>netfilter</code> não bloqueia o acesso.",
      "E": "Todos os processos Samba em execução utilizam a versão mais recente."
    },
    "respostaCorreta": "A",
    "explicacao": "<code>samba-tool testparm</code> (ou o antigo <code>testparm</code>) é um utilitário que apenas lê o arquivo <code>smb.conf</code>, verifica se há erros de sintaxe e exibe a configuração processada (com os padrões preenchidos). Ele não testa a funcionalidade, apenas a validade do arquivo de configuração."
  },
  {
    "id": 66,
    "pergunta": "Selecione a opção do Samba abaixo que deve ser usada se a principal intenção for configurar um serviço de impressão para convidados?",
    "opcoes": {
      "A": "<code>security = cups</code>",
      "B": "<code>security = ldap</code>",
      "C": "<code>security = pam</code>",
      "D": "<code>security = share</code>",
      "E": "<code>security = printing</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "<code>security = share</code> é o nível de segurança do Samba que não requer um nome de usuário ou senha para acessar os compartilhamentos. Isso é ideal para um serviço de impressão 'convidado' (guest), onde qualquer pessoa na rede pode imprimir sem autenticação."
  },
  {
    "id": 67,
    "pergunta": "O <code>smb.conf</code> contém:<pre><code>host allow = 192.168.1.100 192.168.2.0/255.255.255.0 localhost\nhost deny = 192.168.2.31\ninterfaces = 192.168.1.0/255.255.255.0 192.168.2.0/255.255.255.0</code></pre>Uma estação <code>192.168.1.177</code> não consegue acessar. Um laptop <code>192.168.2.93</code> consegue. Quase todas as máquinas na rede <code>192.168.1.0</code> não conseguem. Qual declaração 'host allow' corrigirá isso?",
    "opcoes": {
      "A": "<code>host allow = 192.168.1.1-255</code>",
      "B": "<code>host allow = 192.168.1.100 192.168.2.200 localhost</code>",
      "C": "<code>host deny = 192.168.1.100/255.255.255.0 192.168.2.31 localhost</code>",
      "D": "<code>host deny = 192.168.2.200/255.255.255.0 192.168.2.31 localhost</code>",
      "E": "<code>host allow = 192.168.1.0/255.255.255.0 192.168.2.0/255.255.255.0 localhost</code>"
    },
    "respostaCorreta": "E",
    "explicacao": "O problema é a linha <code>host allow</code> original, que permite *apenas* o IP <code>192.168.1.100</code> da rede <code>.1</code>, mas permite a rede <code>.2</code> inteira. A Opção E corrige isso permitindo ambas as sub-redes inteiras: <code>192.168.1.0/255.255.255.0</code> e <code>192.168.2.0/255.255.255.0</code>."
  },
  {
    "id": 68,
    "pergunta": "PREENCHA A LACUNA - Qual comando exibe as estatísticas do kernel NFS? (Especifique APENAS o comando, sem nenhum caminho ou parâmetro.)",
    "tipo": "fill",
    "respostaCorreta": "nfsstat",
    "explicacao": "O comando <code>nfsstat</code> exibe estatísticas detalhadas sobre a atividade do cliente e servidor NFS, lendo informações do kernel."
  },
  {
    "id": 69,
    "pergunta": "Qual palavra-chave é usada na configuração do Squid para definir redes e horários usados para limitar o acesso ao serviço?",
    "opcoes": {
      "A": "<code>acl</code>",
      "B": "<code>allow</code>",
      "C": "<code>http_allow</code>",
      "D": "<code>permit</code>"
    },
    "respostaCorreta": "A",
    "explicacao": "A diretiva <code>acl</code> (Access Control List) é usada no Squid para definir listas nomeadas de elementos, como endereços IP de origem (<code>src</code>), domínios de destino (<code>dstdomain</code>) ou horários (<code>time</code>). Essas ACLs são então usadas pelas regras <code>http_access</code>."
  },
  {
    "id": 70,
    "pergunta": "A seguinte configuração do Apache foi criada para um host virtual em <code>www.example.com</code> e <code>www2.example.com</code>:<pre><code><VirtualHost *: 80>\n  ServerName www.example.com\n  ServerName www2.example.com\n  ServerAdmin webmaster@example.com\n  DocumentRoot /var/www/\n  <Directory /srv/www/>\n    Require all granted\n  </Directory>\n</Virtual Host></code></pre>...as solicitações não estão sendo tratadas corretamente. O que deve ser alterado?",
    "opcoes": {
      "A": "A configuração deve ser dividida em duas seções <code>VirtualHost</code>.",
      "B": "A porta <code>*:80</code> precisa ser adicionada aos valores de <code>ServerName</code>.",
      "C": "Ambos os nomes devem ser colocados em uma única <code>ServerName</code>, separados por vírgula.",
      "D": "Ambos os nomes devem ser mencionados na tag <code><VirtualHost></code>.",
      "E": "Apenas uma <code>ServerName</code> pode existir, mas nomes adicionais podem ser declarados nas opções <code>ServerAlias</code>."
    },
    "respostaCorreta": "E",
    "explicacao": "Um bloco <code><VirtualHost></code> só pode ter uma diretiva <code>ServerName</code> (o nome canônico). Todos os outros nomes ou aliases para esse mesmo host virtual devem ser listados usando a diretiva <code>ServerAlias</code> (ex: <code>ServerAlias www2.example.com</code>)."
  },
  {
    "id": 71,
    "pergunta": "Considerando o seguinte trecho de configuração do Squid:\n<code>cache_dir ufs /var/spool/squid3/ 1024 16 256</code>\nQuais dos seguintes diretórios existirão diretamente dentro de <code>/var/spool/squid3/</code>? (Escolha duas opções.)",
    "opcoes": {
      "A": "<code>0F</code>",
      "B": "<code>A0</code>",
      "C": "<code>0b</code>",
      "D": "<code>FF</code>",
      "E": "<code>00</code>"
    },
    "respostaCorreta": ["A", "E"],
    "explicacao": "A configuração <code>16 256</code> define a estrutura do cache. O '16' cria 16 diretórios de Nível 1, nomeados em hexadecimal de <code>00</code> a <code>0F</code>. O '256' cria 256 subdiretórios (<code>00</code> a <code>FF</code>) dentro de cada diretório de Nível 1. Portanto, <code>00</code> e <code>0F</code> são diretórios de Nível 1 válidos."
  },
  {
    "id": 72,
    "pergunta": "Quais das seguintes afirmações são verdadeiras em relação ao Server Name Indication (SNI)? (Escolha duas.)",
    "opcoes": {
      "A": "Ele suporta o failover transparente de sessões TLS de um servidor web para outro.",
      "B": "Ele permite que vários hosts HTTP virtuais protegidos por SSL/TLS coexistam no mesmo endereço IP.",
      "C": "Ele permite que os servidores HTTP atualizem o DNS dos nomes de seus hosts virtuais.",
      "D": "Ele fornece uma lista de hosts virtuais disponíveis para o cliente durante o handshake TLS.",
      "E": "Ele envia o nome do host da URL solicitada durante o handshake TLS."
    },
    "respostaCorreta": ["B", "E"],
    "explicacao": "SNI é uma extensão do TLS que permite ao cliente (navegador) enviar o nome do host (E) ao qual está tentando se conectar como parte do handshake TLS. Isso permite que o servidor (B) identifique qual host virtual está sendo solicitado e apresente o certificado SSL/TLS correto, mesmo que múltiplos sites HTTPS estejam no mesmo IP."
  },
  {
    "id": 73,
    "pergunta": "Qual diretiva de configuração do Apache HTTPD especifica a chave privada RSA que foi usada na geração do certificado SSL para o servidor?",
    "opcoes": {
      "A": "<code>SSLCertificateKeyFile</code>",
      "B": "<code>SSLKeyFile</code>",
      "C": "<code>SSLPrivateKeyFile</code>",
      "D": "<code>SSLRSAKeyFile</code>"
    },
    "respostaCorreta": "A",
    "explicacao": "No <code>mod_ssl</code> do Apache, <code>SSLCertificateFile</code> aponta para o certificado público (e cadeia intermediária), e <code>SSLCertificateKeyFile</code> aponta para o arquivo da chave privada correspondente."
  },
  {
    "id": 74,
    "pergunta": "Há uma área restrita em um site hospedado pelo Apache, que exige autenticação no arquivo <code>/srv/www/security/sitepasswd</code>. Qual comando é usado para ALTERAR a senha de usuários existentes, sem perder dados, quando a autenticação básica está sendo usada?",
    "opcoes": {
      "A": "<code>htpasswd -c /srv/www/security/sitepasswd user</code>",
      "B": "<code>htpasswd /srv/www/security/sitepasswd user</code>",
      "C": "<code>htpasswd -n /srv/www/security/sitepasswd user</code>",
      "D": "<code>htpasswd -D /srv/www/security/sitepasswd user</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "O comando <code>htpasswd</code> sem a opção <code>-c</code> atualiza ou adiciona um usuário a um arquivo existente. A opção <code>-c</code> (Opção A) é usada para *criar* um novo arquivo, o que apagaria todos os usuários existentes, violando o requisito 'sem perder dados'."
  },
  {
    "id": 75,
    "pergunta": "Qual diretiva de configuração do Apache HTTPD é usada para especificar o método de autenticação, por exemplo, Nenhum ou Básico?",
    "opcoes": {
      "A": "<code>AuthUser</code>",
      "B": "<code>AllowedAuthUser</code>",
      "C": "<code>AuthType</code>",
      "D": "<code>AllowAuth</code>"
    },
    "respostaCorreta": "C",
    "explicacao": "A diretiva <code>AuthType</code> (ex: <code>AuthType Basic</code>, <code>AuthType Digest</code>, ou <code>AuthType None</code>) define o mecanismo de autenticação que será usado para proteger um diretório."
  },
  {
    "id": 76,
    "pergunta": "Quais das seguintes opções são diretivas de registro de logs no Apache HTTPD? (Escolha duas.)",
    "opcoes": {
      "A": "<code>TransferLog</code>",
      "B": "<code>CustomLog</code>",
      "C": "<code>ErrorLog</code>",
      "D": "<code>ServerLog</code>",
      "E": "<code>VHostLog</code>"
    },
    "respostaCorreta": ["A", "C"],
    "explicacao": "<code>ErrorLog</code> define o arquivo de log de erros. <code>TransferLog</code> é a diretiva original para definir um log de acesso. <code>CustomLog</code> (Opção B) é uma versão mais moderna e flexível do <code>TransferLog</code>, mas ambas são válidas."
  },
  {
    "id": 77,
    "pergunta": "Qual opção em uma seção de configuração do servidor Nginx define o caminho do sistema de arquivos de onde o conteúdo do servidor é recuperado?",
    "opcoes": {
      "A": "<code>location</code>",
      "B": "<code>htdocs</code>",
      "C": "<code>DocumentRoot</code>",
      "D": "<code>root</code>",
      "E": "<code>base_dir</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "No Nginx, a diretiva <code>root</code> (ex: <code>root /var/www/html;</code>) define o diretório raiz para as solicitações, similar ao <code>DocumentRoot</code> do Apache."
  },
  {
    "id": 78,
    "pergunta": "No Nginx, qual das seguintes diretivas é usada para encaminhar requisições para um aplicativo FastCGI?",
    "opcoes": {
      "A": "<code>fastcgi_pass</code>",
      "B": "<code>fastcgi_proxy</code>",
      "C": "<code>proxy_fastcgi</code>",
      "D": "<code>proxy_fastcgi_pass</code>",
      "E": "<code>fastcgi_forward</code>"
    },
    "respostaCorreta": "A",
    "explicacao": "A diretiva <code>fastcgi_pass</code> é usada para informar ao Nginx onde encontrar o backend FastCGI (como o PHP-FPM), por exemplo, <code>fastcgi_pass unix:/var/run/php-fpm.sock;</code>."
  },
  {
    "id": 79,
    "pergunta": "Qual das seguintes informações deve ser enviada a uma autoridade certificadora para solicitar um certificado de servidor web?",
    "opcoes": {
      "A": "A chave privada do servidor web.",
      "B": "O endereço IP do servidor web.",
      "C": "A lista de algoritmos de criptografia suportados pelo servidor web.",
      "D": "O arquivo de configuração SSL do servidor web.",
      "E": "A solicitação de assinatura de certificado."
    },
    "respostaCorreta": "E",
    "explicacao": "A Solicitação de Assinatura de Certificado (CSR) é o arquivo (geralmente criado com <code>openssl req</code>) que contém a chave pública e as informações de identidade (país, organização, nome de domínio) que a CA usará para emitir o certificado. A chave privada (A) nunca deve ser compartilhada."
  },
  {
    "id": 80,
    "pergunta": "Para que finalidade o <code>nmap</code> utiliza a técnica de identificação de pilha TCP/IP?",
    "opcoes": {
      "A": "É usada para determinar o sistema operacional remoto.",
      "B": "É usada para filtrar respostas de servidores específicos.",
      "C": "É usada para identificar respostas duplicadas do mesmo servidor remoto.",
      "D": "É usada para mascarar as respostas de servidores remotos.",
      "E": "É usada para identificar exclusivamente servidores na rede para fins forenses."
    },
    "respostaCorreta": "A",
    "explicacao": "A 'impressão digital' ou 'identificação da pilha TCP/IP' (ativada com <code>-O</code> no <code>nmap</code>) envia sondas de pacotes malformados ou incomuns. A forma como um sistema operacional responde a essas sondas é única, permitindo ao <code>nmap</code> adivinhar qual SO está em execução no alvo."
  },
  {
    "id": 81,
    "pergunta": "Para permitir que as conexões X sejam encaminhadas de ou através de um servidor SSH, qual palavra-chave de configuração deve ser definida como \"yes\" no arquivo de configuração do <code>sshd</code>?",
    "opcoes": {
      "A": "<code>AllowForwarding</code>",
      "B": "<code>ForwardingAllow</code>",
      "C": "<code>XllForwardingAllow</code>",
      "D": "<code>XllForwarding</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "A diretiva <code>X11Forwarding yes</code> no arquivo <code>sshd_config</code> permite o encaminhamento de aplicativos gráficos X Window System através da conexão SSH."
  },
  {
    "id": 82,
    "pergunta": "Qual é a porta padrão utilizada pelo OpenVPN?",
    "opcoes": {
      "A": "1723",
      "B": "4500",
      "C": "500",
      "D": "1194"
    },
    "respostaCorreta": "D",
    "explicacao": "A porta padrão registrada na IANA para o OpenVPN é 1194 (UDP ou TCP). A porta 1723 (A) é usada pelo PPTP; 500 e 4500 (B, C) são usadas pelo IPsec/IKE."
  },
  {
    "id": 83,
    "pergunta": "PREENCHA A LACUNA - Qual opção no arquivo de configuração do <code>sshd</code> instrui o <code>sshd</code> a permitir que apenas nomes de usuário específicos façam login em um sistema? (Especifique APENAS o nome da opção, sem nenhum valor.)",
    "tipo": "fill",
    "respostaCorreta": "AllowUsers",
    "explicacao": "A diretiva <code>AllowUsers</code> (ex: <code>AllowUsers adminuser user1</code>) é usada para criar uma lista de permissões explícita de quais usuários têm permissão para fazer login via SSH."
  },
  {
    "id": 84,
    "pergunta": "Usando sua configuração padrão, como o <code>fail2ban</code> bloqueia clientes SSH mal-intencionados?",
    "opcoes": {
      "A": "Rejeitando conexões devido ao seu papel como proxy na frente do SSHD.",
      "B": "Modificando e ajustando a configuração do SSHD.",
      "C": "Criando e mantendo regras do <code>netfilter</code>.",
      "D": "Criando rotas nulas que descartam quaisquer pacotes de resposta enviados ao cliente.",
      "E": "Modificando e ajustando a configuração do TCP Wrapper para o SSHD."
    },
    "respostaCorreta": "C",
    "explicacao": "A ação padrão do <code>fail2ban</code> é interagir com o <code>netfilter</code> (<code>iptables</code>) para adicionar dinamicamente uma regra que bloqueia (geralmente com REJECT ou DROP) o endereço IP do invasor por um tempo determinado."
  },
  {
    "id": 85,
    "pergunta": "Quais nomes de usuário FTP são reconhecidos como usuários anônimos no <code>vsftpd</code> quando a opção <code>anonymous_enable</code> está definida como <code>yes</code>? (Escolha duas.)",
    "opcoes": {
      "A": "<code>anonymous</code>",
      "B": "<code>ftp</code>",
      "C": "Qualquer nome de usuário que não pertença a um usuário existente...",
      "D": "<code>nobody</code>",
      "E": "<code>guest</code>"
    },
    "respostaCorreta": ["A", "B"],
    "explicacao": "Por padrão, o <code>vsftpd</code> (como a maioria dos servidores FTP) reconhece os nomes de usuário 'anonymous' e 'ftp' como logins anônimos."
  },
  {
    "id": 86,
    "pergunta": "Quais dos seguintes comandos podem ser usados para conectar e interagir com serviços de rede TCP remotos? (Escolha duas opções.)",
    "opcoes": {
      "A": "<code>nettalk</code>",
      "B": "<code>nc</code>",
      "C": "<code>telnet</code>",
      "D": "<code>cat</code>",
      "E": "<code>netmap</code>"
    },
    "respostaCorreta": ["B", "C"],
    "explicacao": "<code>telnet [host] [porta]</code> e <code>nc [host] [porta]</code> (netcat) são ferramentas de linha de comando clássicas usadas para estabelecer conexões TCP brutas com um serviço, permitindo a interação direta com o protocolo."
  },
  {
    "id": 87,
    "pergunta": "Para qual destino uma rota aparecerá na tabela de roteamento do Linux após ativar o IPv6 na interface, mesmo quando nenhum endereço IPv6 global tiver sido atribuído?",
    "opcoes": {
      "A": "<code>fe80::/10</code>",
      "B": "<code>0::/128</code>",
      "C": "<code>0::/0</code>",
      "D": "<code>fe80::/64</code>",
      "E": "<code>2000::/3</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "Quando o IPv6 é ativado em uma interface, ela automaticamente se autoconfigura com um endereço link-local (<code>fe80::...</code>). O kernel adiciona uma rota para a rede link-local (<code>fe80::/64</code>) através dessa interface."
  },
  {
    "id": 88,
    "pergunta": "Para impedir que todos os usuários FTP anônimos listem os nomes dos arquivos enviados, qual precaução de segurança pode ser tomada ao criar um diretório de upload?",
    "opcoes": {
      "A": "O diretório não deve ter a permissão de execução definida.",
      "B": "O diretório não deve ter a permissão de leitura definida.",
      "C": "O diretório não deve ter as permissões de leitura ou execução definidas.",
      "D": "O diretório não deve ter a permissão de escrita definida.",
      "E": "O diretório não deve conter outros diretórios."
    },
    "respostaCorreta": "B",
    "explicacao": "No Linux, a permissão de 'leitura' (r) em um diretório permite listar seu conteúdo. A permissão de 'escrita' (w) permite criar/excluir arquivos, e a 'execução' (x) permite entrar (cd) no diretório. Para um diretório de upload 'cego' (onde se pode enviar, mas não ver), remove-se a permissão de leitura."
  },
  {
    "id": 89,
    "pergunta": "Qual comando é usado para administrar as regras do <code>netfilter</code> para IPv6?",
    "opcoes": {
      "A": "<code>iptables</code>",
      "B": "<code>iptablesv6</code>",
      "C": "<code>iptables6</code>",
      "D": "<code>ip6tables</code>",
      "E": "<code>ipv6tables</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "O <code>netfilter</code> usa comandos separados para diferentes famílias de protocolos. <code>iptables</code> é para IPv4, <code>ip6tables</code> é para IPv6 e <code>arptables</code> é para ARP."
  },
  {
    "id": 90,
    "pergunta": "Qual tabela do <code>netfilter</code> contém as cadeias integradas chamadas INPUT, OUTPUT e FORWARD?",
    "opcoes": {
      "A": "<code>ipconn</code>",
      "B": "<code>filter</code>",
      "C": "<code>nat</code>",
      "D": "<code>default</code>",
      "E": "<code>masq</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "A tabela <code>filter</code> é a tabela padrão e principal do <code>netfilter</code>, usada para filtragem de pacotes. Ela contém as três cadeias principais: <code>INPUT</code> (pacotes para o host), <code>OUTPUT</code> (pacotes do host) e <code>FORWARD</code> (pacotes roteados através do host)."
  },
  {
    "id": 91,
    "pergunta": "Após executar o comando <code>ssh-keygen</code> e aceitar os valores padrão, quais dos seguintes arquivos são alterados ou criados? (Escolha duas opções.)",
    "opcoes": {
      "A": "<code>~/.ssh/id_rsa.key</code>",
      "B": "<code>~/.ssh/id_rsa.pub</code>",
      "C": "<code>~/.ssh/id_rsa.prv</code>",
      "D": "<code>~/.ssh/id_rsa.crt</code>",
      "E": "<code>~/.ssh/id_rsa</code>"
    },
    "respostaCorreta": ["B", "E"],
    "explicacao": "Por padrão, <code>ssh-keygen</code> (para o tipo RSA) cria a chave privada em <code>~/.ssh/id_rsa</code> (E) e a chave pública correspondente em <code>~/.ssh/id_rsa.pub</code> (B)."
  },
  {
    "id": 92,
    "pergunta": "Qual das seguintes opções de configuração do OpenVPN faz com que o OpenVPN encaminhe os pacotes de rede entre os clientes VPN diretamente?",
    "opcoes": {
      "A": "<code>inter-client-traffic</code>",
      "B": "<code>client-to-client</code>",
      "C": "<code>client-router</code>",
      "D": "<code>client-pass</code>",
      "E": "<code>grant-client-traffic</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "Por padrão, os clientes VPN só podem ver o servidor. A diretiva <code>client-to-client</code> no arquivo de configuração do servidor instrui o OpenVPN a permitir que o tráfego flua diretamente entre diferentes clientes conectados."
  },
  {
    "id": 93,
    "pergunta": "Qual dessas ferramentas fornece informações de DNS no seguinte formato?<pre><code>www.example.com has address 172.25.25.55\nwww.example.com has address 172.25.25.63\nwww.example.com has IPv6 address fdb4: 8fbc: 36el: :101f</code></pre>",
    "opcoes": {
      "A": "<code>dig</code>",
      "B": "<code>nslookup</code>",
      "C": "<code>host</code>",
      "D": "<code>named-checkconf</code>",
      "E": "<code>named-checkzone</code>"
    },
    "respostaCorreta": "C",
    "explicacao": "O comando <code>host</code> é uma ferramenta de consulta DNS simples e direta. Sua saída padrão é formatada dessa maneira amigável, '... has address ...', tornando-a fácil de ler."
  },
  {
    "id": 94,
    "pergunta": "Qual subcomando do <code>rdnc</code> pode ser usado em conjunto com o nome de uma zona para fazer com que o BIND releia o conteúdo do arquivo de zona específico sem recarregar as outras zonas?",
    "opcoes": {
      "A": "<code>lookup</code>",
      "B": "<code>reload</code>",
      "C": "<code>fileupdate</code>",
      "D": "<code>reread</code>",
      "E": "<code>zoneupdate</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "O comando <code>rndc reload [nome-da-zona]</code> instrui o BIND a recarregar apenas o arquivo de zona especificado. Usar <code>rndc reload</code> sem um nome de zona recarrega todos os arquivos de zona."
  },
  {
    "id": 95,
    "pergunta": "Um arquivo de zona contém as seguintes linhas:<pre><code>$ORIGIN example.com\nhost2.example.org. IN A 198.51.100.102</code></pre>e está incluído na configuração do BIND:<pre><code>zone \"example.com\" {\n  type master;\n  file \"db.example.com\";\n};</code></pre>Qual problema está presente nesta configuração?",
    "opcoes": {
      "A": "A declaração de zona deve conter <code>cross-zone-data yes;</code>.",
      "B": "A zona não pode conter registros para um nome que esteja fora da hierarquia da zona.",
      "C": "A declaração <code>$ORIGIN</code> não pode ser usada em arquivos de zona.",
      "D": "Um registro <code>A</code> não pode conter um endereço IPv4.",
      "E": "Os nomes dos registros em um arquivo de zona não podem ser FQDNs."
    },
    "respostaCorreta": "B",
    "explicacao": "O arquivo de zona é para <code>example.com</code>. A presença de um registro para <code>host2.example.org.</code> (um domínio totalmente diferente) dentro deste arquivo de zona é considerada 'dado fora da zona' (out-of-zone data) e geralmente é ignorada ou causa um erro."
  },
  {
    "id": 96,
    "pergunta": "Qual dos seguintes tipos de registro DNS é usado para consultas de DNS reverso?",
    "opcoes": {
      "A": "<code>CNAME</code>",
      "B": "<code>IN</code>",
      "C": "<code>PTR</code>",
      "D": "<code>REV</code>",
      "E": "<code>RIN</code>"
    },
    "respostaCorreta": "C",
    "explicacao": "O registro <code>PTR</code> (Pointer) é usado em zonas de pesquisa reversa (<code>in-addr.arpa.</code>) para mapear um endereço IP de volta para um nome de host."
  },
  {
    "id": 97,
    "pergunta": "PREENCHA A LACUNA - De acordo com a configuração abaixo, qual é o endereço de e-mail completo do administrador deste domínio?<pre><code>$ORIGIN example.com\n@   IN  SOA mars. example.com pluto. example.com (\n...</code></pre>",
    "tipo": "fill",
    "respostaCorreta": "pluto@example.com",
    "explicacao": "No registro SOA, o segundo nome (<code>pluto. example.com</code>) é o RNAME (nome responsável). Para formar o endereço de e-mail, o primeiro ponto (<code>.</code>) é substituído por um <code>@</code>, resultando em <code>pluto@example.com</code>."
  },
  {
    "id": 98,
    "pergunta": "Qual é a finalidade do DANE?",
    "opcoes": {
      "A": "Verificar a integridade das informações de nomes recuperadas via DNS.",
      "B": "Permitir atualizações seguras de DNS dinâmico.",
      "C": "Invalidar informações de nomes armazenadas em servidores de nomes de cache.",
      "D": "Descobrir quais servidores em um domínio DNS oferecem um serviço específico.",
      "E": "Fornecer uma maneira de verificar a associação de certificados X.509 a nomes de host DNS."
    },
    "respostaCorreta": "E",
    "explicacao": "DANE (DNS-based Authentication of Named Entities) usa registros DNS (protegidos por DNSSEC) para publicar informações sobre quais certificados TLS/SSL são válidos para um serviço, ajudando a prevenir ataques de 'man-in-the-middle' e de CA comprometida."
  },
  {
    "id": 99,
    "pergunta": "Um servidor BIND deve ser atualizado para usar TSIG. Quais parâmetros de configuração devem ser adicionados se o servidor usar o algoritmo <code>hmac-md5</code> e a chave <code>skrKc4DoTzi/takIlPi7JZA==</code>?",
    "opcoes": {
      "A": "<pre><code>TSIG server.example.com. {\n  algorithm hmac-md5;\n  secret \"skrKc4DoTzi/takIlPi7JZA == \";\n};\n</code></pre>",
      "B": "<pre><code>key.server.example.com. {\n  algorithm hmac-md5;\n  secret skrKc4DoTzi/takIlPi7JZA ==;\n};\n</code></pre>",
      "C": "<pre><code>key.server.example.com. {\n  algorithm hmac-md5;\n  secret \"skrKc4DoTzi/takIlPi7JZA == \";\n};\n</code></pre>",
      "D": "<pre><code>key.server.example.com. {\n  algorithm=hmac-md5;\n  secret=\"skrKc4DoTzi/takIlPi7JZA == \";\n};\n</code></pre>",
      "E": "<pre><code>key.server.example.com.\n  algorithm hmac-md5\n  secret \"skrKc4DoTzi/takIlPi7JZA == \";\n</code></pre>"
    },
    "respostaCorreta": "C",
    "explicacao": "A sintaxe correta para definir uma chave TSIG (Transaction SIGnature) no BIND usa a diretiva <code>key</code>, seguida pelo nome da chave, e um bloco contendo as diretivas <code>algorithm</code> e <code>secret</code>. O segredo (a chave) deve estar entre aspas."
  },
  {
    "id": 100,
    "pergunta": "Qual opção no arquivo <code>named.conf</code> especifica quais hosts têm permissão para solicitar informações de nomes de domínio ao servidor?",
    "opcoes": {
      "A": "<code>allowed-hosts</code>",
      "B": "<code>accept-query</code>",
      "C": "<code>permit-query</code>",
      "D": "<code>allow-query</code>",
      "E": "<code>query-group</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "A diretiva <code>allow-query</code> (ex: <code>allow-query { localhost; my_acl; };</code>) é usada no <code>named.conf</code> para definir quais endereços IP têm permissão para fazer consultas DNS a este servidor."
  },
  {
    "id": 101,
    "pergunta": "PREENCHA A LACUNA - Qual subcomando do <code>doveadm</code> exibe uma lista de conexões do Dovecot? (Especifique APENAS o comando, sem nenhum parâmetro.)",
    "tipo": "fill",
    "respostaCorreta": "who",
    "explicacao": "O comando <code>doveadm who</code> exibe uma lista de todos os usuários atualmente conectados ao servidor Dovecot (via IMAP/POP3), incluindo seus endereços IP e nomes de usuário."
  },
  {
    "id": 102,
    "pergunta": "Quais das seguintes ações estão disponíveis nos filtros principais do Sieve? (Escolha três.)",
    "opcoes": {
      "A": "<code>drop</code>",
      "B": "<code>discard</code>",
      "C": "<code>fileinto</code>",
      "D": "<code>relay</code>",
      "E": "<code>reject</code>"
    },
    "respostaCorreta": ["B", "C", "E"],
    "explicacao": "<code>discard</code> (B) descarta silenciosamente a mensagem. <code>fileinto</code> (C) move a mensagem para uma pasta específica. <code>reject</code> (E) envia uma notificação de falha (bounce) ao remetente. <code>drop</code> (A) não é uma ação Sieve padrão (<code>discard</code> é)."
  },
  {
    "id": 103,
    "pergunta": "Quais das seguintes instruções permitem combinações lógicas de condições em filtros Sieve? (Escolha duas.)",
    "opcoes": {
      "A": "<code>allof</code>",
      "B": "<code>anyof</code>",
      "C": "<code>noneof</code>",
      "D": "<code>and</code>",
      "E": "<code>or</code>"
    },
    "respostaCorreta": ["A", "B"],
    "explicacao": "Sieve usa <code>allof</code> (lógica E - todas as condições devem ser verdadeiras) e <code>anyof</code> (lógica OU - qualquer uma das condições pode ser verdadeira) para agrupar testes de condição."
  },
  {
    "id": 104,
    "pergunta": "Qual parâmetro de configuração em um servidor Postfix modifica apenas o endereço do remetente e não o endereço do destinatário?",
    "opcoes": {
      "A": "<code>alias_maps</code>",
      "B": "<code>alias_rewrite_maps</code>",
      "C": "<code>sender_canonical_maps</code>",
      "D": "<code>sender_rewrite_maps</code>"
    },
    "respostaCorreta": "C",
    "explicacao": "<code>sender_canonical_maps</code> é usado para reescrever (reescrever) endereços de remetentes (Sender) para um formato 'canônico' (oficial), por exemplo, mudando <code>user@host.local</code> para <code>user@example.com</code>. <code>alias_maps</code> (A) processa destinatários."
  },
  {
    "id": 105,
    "pergunta": "PREENCHA A LACUNA - Qual opção na configuração do Postfix faz com que o Postfix encaminhe e-mails para destinos externos para outro servidor SMTP? (Especifique APENAS o nome da opção, sem nenhum valor.)",
    "tipo": "fill",
    "respostaCorreta": "relayhost",
    "explicacao": "O parâmetro <code>relayhost</code> (ex: <code>relayhost = [smtp.provedor.com]</code>) define o 'smarthost' para o qual o Postfix encaminhará todos os e-mails que não são para domínios locais."
  },
  {
    "id": 106,
    "pergunta": "Qual é o nome da variável de configuração do Dovecot que especifica a localização das caixas de correio dos usuários?",
    "opcoes": {
      "A": "<code>mbox</code>",
      "B": "<code>mail_location</code>",
      "C": "<code>user_dir</code>",
      "D": "<code>maildir</code>",
      "E": "<code>user_mail_dir</code>"
    },
    "respostaCorreta": "B",
    "explicacao": "A diretiva <code>mail_location</code> (ex: <code>mail_location = maildir:~/Maildir</code>) é o parâmetro principal no Dovecot para definir o formato e o caminho de armazenamento das caixas de correio dos usuários."
  },
  {
    "id": 107,
    "pergunta": "No arquivo de configuração principal do Postfix, como as definições de serviço são continuadas na linha seguinte?",
    "opcoes": {
      "A": "Não é possível. A definição do serviço deve caber em uma única linha.",
      "B": "A linha inicial deve terminar com uma barra invertida (<code>\\</code>).",
      "C": "A linha seguinte deve começar com um sinal de mais (<code>+</code>).",
      "D": "A linha seguinte deve começar com um espaço em branco (indentação).",
      "E": "A definição do serviço continua nas linhas seguintes até que todos os campos..."
    },
    "respostaCorreta": "D",
    "explicacao": "Nos arquivos <code>main.cf</code> e <code>master.cf</code> do Postfix, uma linha que começa com espaço em branco ou tabulação é tratada como uma continuação da linha anterior."
  },
  {
    "id": 108,
    "pergunta": "Qual dos seguintes comandos exibe uma visão geral do conteúdo da fila do Postfix para ajudar a identificar sites remotos que estão causando tráfego excessivo de e-mails?",
    "opcoes": {
      "A": "<code>mailtraf</code>",
      "B": "<code>queuequery</code>",
      "C": "<code>qshape</code>",
      "D": "<code>postmap</code>",
      "E": "<code>poststats</code>"
    },
    "respostaCorreta": "C",
    "explicacao": "O comando <code>qshape</code> (parte do Postfix) analisa a fila de e-mails (ativa, deferida) e gera um relatório resumido, agrupando as mensagens por domínio de destino, o que é ideal para identificar gargalos."
  },
  {
    "id": 109,
    "pergunta": "Quais destes conjuntos de entradas o seguinte comando retorna?<pre><code>ldapsearch -x \" ( | (cn=marie) (! (telephoneNumber=9*) ) ) \"</code></pre>",
    "opcoes": {
      "A": "Entradas que não têm um <code>cn</code> igual a \"marie\" ou não têm um <code>telephoneNumber</code> que começa com 9.",
      "B": "Entradas que têm um <code>cn</code> igual a \"marie\" ou não têm um <code>telephoneNumber</code> que começa com 9.",
      "C": "Entradas que têm um <code>cn</code> igual a \"marie\" e um <code>telephoneNumber</code> que termina com 9.",
      "D": "Entradas que não têm um <code>cn</code> igual a \"marie\" e não têm um <code>telephoneNumber</code> que começa com 9.",
      "E": "Entradas que têm um <code>cn</code> igual a \"marie\" ou têm um <code>telephoneNumber</code> que começa com 9."
    },
    "respostaCorreta": "B",
    "explicacao": "Este é um filtro de pesquisa LDAP. <code>|</code> é o operador OU (OR). O filtro procura por entradas que correspondam à primeira condição (<code>(cn=marie)</code>) OU à segunda condição (<code>(!(telephoneNumber=9*))</code>), que significa 'o número de telefone não começa com 9'."
  },
  {
    "id": 110,
    "pergunta": "Quais dos seguintes tipos de atribuição de endereços IPv6 o DHCPv6 suporta? (Escolha três.)",
    "opcoes": {
      "A": "Atribuições de endereços IPv6 normais que podem ser renovados.",
      "B": "Atribuições de endereços IPv6 temporários que não podem ser renovados.",
      "C": "Atribuições de endereços IPv6 bloqueados que não devem mais ser usados.",
      "D": "Atribuições de prefixos IPv6 que podem ser usados para roteamento ou atribuições adicionais.",
      "E": "Atribuições de endereços IPv6 anônimos cuja atribuição não é registrada."
    },
    "respostaCorreta": ["A", "B", "D"],
    "explicacao": "O DHCPv6 pode atribuir: 1) Endereços 'não temporários' (IA_NA), que são endereços padrão e renováveis (A). 2) Endereços 'temporários' (IA_TA), que são de curta duração (B). 3) Delegação de Prefixo (IA_PD), onde o servidor DHCPv6 entrega um prefixo de rede inteiro (ex: /60) para um roteador cliente (D)."
  },
  {
    "id": 111,
    "pergunta": "PREENCHA A LACUNA - Qual atributo de um objeto no LDAP define quais outros atributos podem ser definidos para o objeto? (Especifique APENAS o nome do atributo, sem nenhum valor.)",
    "tipo": "fill",
    "respostaCorreta": "objectClass",
    "explicacao": "O atributo <code>objectClass</code> define o 'schema' da entrada. Ele especifica quais atributos são *obrigatórios* (MUST) e quais são *opcionais* (MAY) para aquela entrada."
  },
  {
    "id": 113,
    "pergunta": "Qual das seguintes afirmações está correta sobre este trecho de um arquivo LDIF?<pre><code>dn: cn=PrintOperators, ou=Groups, o=IT, DC=mycompany, DC=example, DC=com</code></pre>",
    "opcoes": {
      "A": "<code>dn</code> é o nome de domínio.",
      "B": "<code>o</code> é o nome do operador.",
      "C": "<code>cn</code> é o nome comum.",
      "D": "<code>dn</code> é o nome distinto relativo.",
      "E": "<code>DC</code> é o contêiner de delegação."
    },
    "respostaCorreta": "C",
    "explicacao": "<code>dn</code> significa Nome Distinto (o caminho completo). <code>cn</code> significa Nome Comum (Common Name). <code>ou</code> significa Unidade Organizacional. <code>o</code> significa Organização. <code>DC</code> significa Componente de Domínio."
  },
  {
    "id": 114,
    "pergunta": "Qual das seguintes afirmações está INCORRETA em relação ao formato de arquivo LDIF?",
    "opcoes": {
      "A": "Ele contém uma linha \"dn\" que indica onde os atributos... devem ser adicionados.",
      "B": "No arquivo, uma linha em branco separa uma entrada da outra.",
      "C": "Se um atributo contiver dados binários, algumas configurações específicas devem ser feitas...",
      "D": "O arquivo LDIF aceita qualquer tipo de codificação de arquivo."
    },
    "respostaCorreta": "D",
    "explicacao": "A afirmação D está incorreta. O padrão LDIF (LDAP Data Interchange Format) é estritamente baseado em texto e, historicamente, esperava codificação ASCII. Embora o UTF-8 seja comumente suportado agora, ele não 'aceita qualquer tipo de codificação', e dados binários (C) devem ser codificados em Base64."
  },
  {
    "id": 115,
    "pergunta": "Qual opção no arquivo de configuração do ISC DHCPD define o(s) endereço(s) do servidor DNS IPv4 a ser(em) enviado(s) aos clientes DHCP?",
    "opcoes": {
      "A": "<code>option domain-name-servers</code>",
      "B": "<code>option domain-server</code>",
      "C": "<code>option name-server</code>",
      "D": "<code>option servers</code>"
    },
    "respostaCorreta": "A",
    "explicacao": "No ISC DHCPD, as opções DHCP são prefixadas com <code>option</code>. A opção correta para definir servidores DNS é <code>option domain-name-servers 8.8.8.8, 8.8.4.4;</code>."
  },
  {
    "id": 116,
    "pergunta": "Qual dos seguintes módulos PAM define e remove variáveis de ambiente?",
    "opcoes": {
      "A": "<code>pam_set</code>",
      "B": "<code>pam_shell</code>",
      "C": "<code>pam-vars</code>",
      "D": "<code>pam_env</code>",
      "E": "<code>pam_export</code>"
    },
    "respostaCorreta": "D",
    "explicacao": "O módulo <code>pam_env</code> é usado para definir ou remover variáveis de ambiente para a sessão do usuário, geralmente lendo-as do arquivo <code>/etc/security/pam_env.conf</code>."
  },
  {
    "id": 117,
    "pergunta": "Qual das seguintes linhas é válida em um arquivo de configuração em <code>/etc/pam.d/</code>?",
    "opcoes": {
      "A": "<code>auth required pam_unix.so try_first_pass nullok</code>",
      "B": "<code>auth try_first_pass nullok, require pam_unix.so</code>",
      "C": "<code>auth required:pam_unix.so(try_first_pass nullok)</code>",
      "D": "<code>auth pam_unix.so(required try_first_pass nullok)</code>"
    },
    "respostaCorreta": "A",
    "explicacao": "A sintaxe PAM correta é: <code>tipo-de-módulo controle módulo-caminho [argumentos]</code>. A Opção A segue perfeitamente esse formato: <code>auth</code> (tipo), <code>required</code> (controle), <code>pam_unix.so</code> (módulo) e <code>try_first_pass nullok</code> (argumentos)."
  },
  {
    "id": 118,
    "pergunta": "Selecione a alternativa que mostra a maneira correta de desabilitar o login para todos os usuários, exceto o usuário root.",
    "opcoes": {
      "A": "O uso do módulo <code>pam_block</code>...",
      "B": "O uso do módulo <code>pam_deny</code>...",
      "C": "O uso do módulo <code>pam_pwdb</code>...",
      "D": "O uso do módulo <code>pam_nologin</code> juntamente com o arquivo de configuração <code>/etc/nologin</code>."
    },
    "respostaCorreta": "D",
    "explicacao": "O módulo <code>pam_nologin</code> verifica a existência do arquivo <code>/etc/nologin</code>. Se o arquivo existir, este módulo impede o login de todos os usuários, *exceto* o <code>root</code>."
  },
  {
    "id": 119,
    "pergunta": "Quais dos seguintes valores podem ser usados no atributo OpenLDAP <code>olcBackend</code> para especificar um backend? (Escolha três.)",
    "opcoes": {
      "A": "<code>xml</code>",
      "B": "<code>bdb</code>",
      "C": "<code>passwd</code>",
      "D": "<code>ldap</code>",
      "E": "<code>text</code>"
    },
    "respostaCorreta": ["B", "C", "D"],
    "explicacao": "OpenLDAP suporta vários backends. <code>bdb</code> (ou <code>hdb</code>) é o backend de banco de dados tradicional. <code>ldap</code> (D) é um backend de proxy que encaminha para outro servidor LDAP. <code>passwd</code> (C) é um backend que atende a partir do arquivo <code>/etc/passwd</code> local."
  }
]